zeroWin/BP_MSP430/main.c
//******************************************************************************
//  MSP430F149-Noninvasive Blood Pressure Monitor
//  Nov 2013
//  Built with IAR Embedded Workbench Version: 5.3
//******************************************************************************
#include  <msp430x14x.h>
#include  <math.h>
#include  "typedefs.h"
#include "oled_main.h"
#include "hal_type.h"
#include "hal_uart_cc2530.h"
#include "hal_rtc_ds1302.h"
#include "hal_delay.h"
#include "main.h"
#include "hal_BP_measure.h"
/*****************************************************************************
变量定义
******************************************************************************/
u32 BP_DC;
u32 BP_AC;
u16 BP_MAX;
u16 BP_MIN;
u16 AC_MAX;
int BP_MID;
int BP_P2P;
int BP_Low;
int BP_High;
float k1=0;
float k2=0;
float abp=0;
float bp;
int SYS;
int DIA;
u32 pressure;
int display_time=0;
u8  show=0;
struct Pointss
{
  int bp;
  int p2p;
} Points[100];                                     //DC、AC矩阵
unsigned int n_P=0;                                //number of points
unsigned int last_is_low=0;

unsigned int delay_times=0;
unsigned char step=101;
char command;
int value1;
int ch1;
int value2;
int ch2;
int value3;
int ch3;
int value4;
int ch4;
unsigned char const hello[4]={0x4B,0x3A,0x1F,0x2E};//串口握手协议
unsigned char RBUF[8];
unsigned char R_SP=0;
int Prepressure=3500;
//int Prepressure=4000;
int Device_waite_time1;
/*****************************************************************************
函数声明
*****************************************************************************/
void Init_Clock();
void Init_Port1();
void Init_Port2();
void Init_Port4();
void Init_Port5();
void Init_Port6();
void Init_TimerA();
void Stop_BPMeasure(void);
void Start_BPMeasure(void);
extern void usDelay(int microeconds);
extern void Write_8402(u16 data_8402);
extern void delay_ms(u16 nms);
extern void delay_s(u16 ns);
extern void PUMP_ON(u16 motorspeed);
extern void PUMP_OFF(void);
extern void VALVE_ON(void);
extern void VALVE_OFF(void);
extern void write_oled_command(unsigned char ucCmd);
extern void write_oled_data(unsigned char ucData);
unsigned int adc2mmhg(unsigned int adc);
void RBUF_PROCESS(void);
int abs(int a);
void Find_Hign_Low_BP();

BPSystemStatus_t BPSystemStatus;
/*****************************************************************************
主程序
*****************************************************************************/
void main(void)
{
  WDTCTL = WDTPW + WDTHOLD;                //关闭看门狗电路
  Init_Clock();
  Init_Port1();
  Init_Port2();
  P2OUT &= ~BIT4;
  UART1_Config_Init();                     // UART-CC2530初始化
  HalRTCInit();                            // DS1302 初始化
  Init_Port4();
  Init_Port6();                             
  //VALVE_OFF();                             //通道0 控制电磁阀
  VALVE_ON();
  PUMP_OFF();                              //通道1 控制气泵
  Init_TimerA();
  step=101;
  oledinit();
  OLED_ShowString(SPO2_Symbol_Start_X+16,SPO2_Symbol_Start_Y,16,"SYS");
  OLED_ShowString(PR_Symbol_Start_X,PR_Symbol_Start_Y,16,"DIA");    
  Show_Wait_Symbol("Off_IDLE");    
  OLED_Refresh_Gram();
  delay_ms(10);
  BPSystemStatus =  BP_OFFLINE_IDLE;
  _EINT();
  while(1)
  {
    if(BPSystemStatus == BP_OFFLINE_IDLE || BPSystemStatus == BP_ONLINE_IDLE)       //离线等待状态
    {                                              
      //step=101;
      OLED_SLEEP(0);                           //打开显示器 
      if(Device_waite_time1 <15000)
      {
        delay_ms(2);
        Device_waite_time1++;
      }
      else                                     //等待15s，如果无操作则进入休眠状态
      {
        if(BPSystemStatus == BP_OFFLINE_IDLE) // 离线空闲状态
          BPSystemStatus = BP_OFF_SLEEP;
        if(BPSystemStatus == BP_ONLINE_IDLE) // 在线空闲状态
          BPSystemStatus = BP_ON_SLEEP;
      }
    }
    else if(BPSystemStatus == BP_OFF_SLEEP || BPSystemStatus == BP_ON_SLEEP)       //进入睡眠状态
    {
      OLED_SLEEP(1);                             //关闭显示器        
      _BIS_SR(LPM0_bits + GIE);                  //进入低功耗
    }
    else if(BPSystemStatus == BP_OFFLINE_MEASURE)     //测量状态
    {
      if(step==30) // step=30说明测量结果
      { 
        Find_Hign_Low_BP();                    //计算高低血压值
        // BP_High 和 BP_Low        

        step =101;
        OLED_ShowString(SPO2_Symbol_Start_X,0,12,"Off_IDLE");
        OLED_ShowString(0,30,32,"        ");  //8个空格，完全清空
        
        if(BP_High<100)
          OLED_ShowNum(SPO2_Show2Num_Start_X,SPO2_Show2Num_Start_Y,BP_High,2,32);              
        else
          OLED_ShowNum(SPO2_Show3Num_Start_X,SPO2_Show3Num_Start_Y,BP_High,3,32);
        if(BP_Low < 100)
          OLED_ShowNum(HR_Show2Num_Start_X,HR_Show2Num_Start_Y,BP_Low,2,32);              
        else
          OLED_ShowNum(HR_Show3Num_Start_X ,HR_Show3Num_Start_Y,BP_Low,3,32);
        OLED_Refresh_Gram();                  
        BPSystemStatus = BP_OFFLINE_IDLE;
      }
    } 
  }              
}

/*****************************************************************************
定时器A中断服务程序
*****************************************************************************/
#pragma vector=TIMERA0_VECTOR
__interrupt void Timer_A (void)
{
     static long BP_AC_AVE=0;  
     static long BP_AC_AVE_times=0;
     P2OUT ^= 0x10;     
     ADC12CTL0 |= ADC12SC;                     // Start conversion
     BP_DC = ADC12MEM0;                        // Move A0 results
     BP_AC = ADC12MEM1;                        // Move A1 results
     if(delay_times<30000)
       delay_times++;                            //延时次数累加
     if(display_time==255)
     {
       display_time=0;
       show=1;
     }
     else
     {
       display_time++;
     }       
     //pressure=((BP_DC*3.3/4095)/233.56)*1000*15.52;
     bp=((BP_DC*3.3/4095)/233.56)*1000*15.52;
     pressure=(u32)(bp);
     if(show==1)
     {
       show=0;
       if(pressure<10)
       {
         OLED_ShowNum(SPO2_Show2Num_Start_X+27,SPO2_Show2Num_Start_Y,0,1,32);
         OLED_ShowNum(SPO2_Show2Num_Start_X+43,SPO2_Show2Num_Start_Y,0,1,32);
         OLED_ShowNum(SPO2_Show2Num_Start_X+59,SPO2_Show2Num_Start_Y,pressure,1,32);
       }
       else if((pressure<100)&&(pressure>9))
       {
         OLED_ShowNum(SPO2_Show2Num_Start_X+27,SPO2_Show2Num_Start_Y,0,1,32);
         OLED_ShowNum(SPO2_Show2Num_Start_X+43,SPO2_Show2Num_Start_Y,pressure,2,32);
       }
       else
         OLED_ShowNum(SPO2_Show3Num_Start_X+27,SPO2_Show3Num_Start_Y,pressure,3,32);
       OLED_Refresh_Gram();             
     }
     switch(step)
     {       
     case 0:                                    //变量初始化
       delay_times=0;
       BP_AC_AVE=0;
       BP_AC_AVE_times=0;
       BP_MIN=BP_AC_AVE;
       BP_MAX=0;
       AC_MAX=0;
       last_is_low=0;              
       step=5;
       break;
     
     case 5:                                   //BP_AC基准求取并控制气泵充气
       BP_AC_AVE+=BP_AC;
       BP_AC_AVE_times++;
       if(BP_AC_AVE_times>=128)
       { 
         BP_AC_AVE=BP_AC_AVE>>7;
         PUMP_ON(0x0100);             //开始充气
         step=10;
       }                
       break;
       
